---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.FormFailures
source: html/61fc1c4c-8135-f855-1272-97e16b3d4c48.htm
---
# BuiltInFailures.FormFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.